In [1]:
import pandas as pd
import numpy as np

In [2]:
data = pd.Series([0.25, 0.5, 0.75, 1.0])
data

0    0.25
1    0.50
2    0.75
3    1.00
dtype: float64

In [3]:
data.values

array([0.25, 0.5 , 0.75, 1.  ])

In [4]:
data.index

RangeIndex(start=0, stop=4, step=1)

In [5]:
data[1]

0.5

In [6]:
data[1:3]

1    0.50
2    0.75
dtype: float64

In [7]:
data = pd.Series([0.25, 0.5, 0.75, 1.0],
                 index=['a', 'b', 'c', 'd'])
data

a    0.25
b    0.50
c    0.75
d    1.00
dtype: float64

In [8]:
data['b']

0.5

In [9]:
s = pd.Series(25, index=['a','b','c'])
s

a    25
b    25
c    25
dtype: int64

In [10]:
a = pd.Series([9,8,7,6])
a

0    9
1    8
2    7
3    6
dtype: int64

In [11]:
b = pd.Series([9,8,7,6],index=['a','b','c','d'])
b

a    9
b    8
c    7
d    6
dtype: int64

In [12]:
d = pd.Series({'a':9, 'b':8, 'c':7})
d

a    9
b    8
c    7
dtype: int64

In [13]:
e = pd.Series({'a':9, 'b':8, 'c':7}, index=['c','a','b','d'])
e

c    7.0
a    9.0
b    8.0
d    NaN
dtype: float64

In [14]:
n = pd.Series(np.arange(5))

In [15]:
n

0    0
1    1
2    2
3    3
4    4
dtype: int64

In [16]:
m = pd.Series(np.arange(5), index=np.arange(9,4,-1))

In [17]:
m

9    0
8    1
7    2
6    3
5    4
dtype: int64

In [18]:
b = pd.Series([9,8,7,6],['a','b','c','d'])

In [19]:
b.name

In [20]:
b.name = 'Series对象'
b.index.name = '索引列'
b

索引列
a    9
b    8
c    7
d    6
Name: Series对象, dtype: int64

In [21]:
b = pd.Series([9,8,7,6],['a','b','c','d'])
b

a    9
b    8
c    7
d    6
dtype: int64

In [22]:
b.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [23]:
b.values

array([9, 8, 7, 6])

In [24]:
b['b']

8

In [25]:
b[1]

8

In [26]:
b[2]

7

In [27]:
b[3]

6

In [28]:
b[0]

9

In [29]:
b[['c','d',0]]

/Users/byj/opt/anaconda3/lib/python3.7/site-packages/pandas/core/series.py:1152: FutureWarning:
Passing list-likes to .loc or [] with any missing label will raise
KeyError in the future, you can use .reindex() as an alternative.

See the documentation here:
https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#deprecate-loc-reindex-listlike
  return self.loc[key]

c    7.0
d    6.0
0    NaN
dtype: float64

In [30]:
b[['c','d','a']]

c    7
d    6
a    9
dtype: int64

In [31]:
b.iloc[1]

8

In [32]:
b.loc['b']

8

In [33]:
b[3]

6

In [34]:
b[:3]

a    9
b    8
c    7
dtype: int64

In [35]:
[b > b.median()]

[a     True
 b     True
 c    False
 d    False
 dtype: bool]

In [36]:
np.exp(b)

a    8103.083928
b    2980.957987
c    1096.633158
d     403.428793
dtype: float64

In [37]:
a = pd.Series([1,2,3],['c','d','e'])

In [38]:
b = pd.Series([9,8,7,6],['a','b','c','d'])

In [39]:
a+b

a    NaN
b    NaN
c    8.0
d    8.0
e    NaN
dtype: float64

In [40]:
b = pd.Series([9,8,7,6],['a','b','c','d'])
b['a'] = 15

In [41]:
b.name = 'Series'

In [42]:
b

a    15
b     8
c     7
d     6
Name: Series, dtype: int64

In [43]:
b.name = 'New Series'

In [44]:
b['b','c'] = 20

In [45]:
b

a    15
b    20
c    20
d     6
Name: New Series, dtype: int64

In [46]:
s = pd.Series([1, 2, 3])
s

0    1
1    2
2    3
dtype: int64

In [47]:
s.loc['Animal'] = 'Bears'
s

0             1
1             2
2             3
Animal    Bears
dtype: object

In [48]:
original = pd.Series({'province':'Zhejiang', 'city':'ningbo', 'college':'Zhejiang University'})

In [49]:
major = pd.Series(['大数据','云计算','移动App开发','区块链'], index=['major','major','major','major'])

In [50]:
original_major = original.append(major)

In [51]:
original

province               Zhejiang
city                     ningbo
college     Zhejiang University
dtype: object

In [52]:
major

major        大数据
major        云计算
major    移动App开发
major        区块链
dtype: object

In [53]:
original_major

province               Zhejiang
city                     ningbo
college     Zhejiang University
major                       大数据
major                       云计算
major                   移动App开发
major                       区块链
dtype: object

In [54]:
original_major.loc['major']

major        大数据
major        云计算
major    移动App开发
major        区块链
dtype: object

In [55]:
population_dict = {'California': 38332521,
                   'Texas': 26448193,
                   'New York': 19651127,
                   'Florida': 19552860,
                   'Illinois': 12882135}
population = pd.Series(population_dict)
population

California    38332521
Texas         26448193
New York      19651127
Florida       19552860
Illinois      12882135
dtype: int64

In [56]:
area_dict = {'California': 423967, 'Texas': 695662, 
             'New York': 141297,
             'Florida': 170312, 'Illinois': 149995}
area = pd.Series(area_dict)
area

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
dtype: int64

In [57]:
states = pd.DataFrame({'population': population,
                       'area': area})
states

            population    area
California    38332521  423967
Texas         26448193  695662
New York      19651127  141297
Florida       19552860  170312
Illinois      12882135  149995

In [58]:
states.index

Index(['California', 'Texas', 'New York', 'Florida', 'Illinois'], dtype='object')

In [59]:
states.columns

Index(['population', 'area'], dtype='object')

In [60]:
df = pd.DataFrame()
print(df)

Empty DataFrame
Columns: []
Index: []

In [61]:
d = pd.DataFrame(np.arange(10).reshape(2,5))
d

   0  1  2  3  4
0  0  1  2  3  4
1  5  6  7  8  9

In [62]:
data = {'Name':['Tom','Jack','Steve','Ricky'],'Age':[28,34,29,42]}
df = pd.DataFrame(data)
df

    Name  Age
0    Tom   28
1   Jack   34
2  Steve   29
3  Ricky   42

In [63]:
data = {'Name':['Tom','Jack','Steve','Ricky'],'Age':[28,34,29,42]}
df = pd.DataFrame(data,index=['rank1','rank2','rank3','rank4'])
df

        Name  Age
rank1    Tom   28
rank2   Jack   34
rank3  Steve   29
rank4  Ricky   42

In [64]:
dt = {'one':pd.Series([1,2,3],index=['a','b','c']),
      'two':pd.Series([9,8,7,6],index=['a','b','c','d'])}
d = pd.DataFrame(dt)
d

   one  two
a  1.0    9
b  2.0    8
c  3.0    7
d  NaN    6

In [65]:
data = [{'a': 1, 'b': 2},{'a': 5, 'b': 10, 'c': 20}]
df = pd.DataFrame(data)
df

   a   b     c
0  1   2   NaN
1  5  10  20.0

In [66]:
data = [{'a': 1, 'b': 2},{'a': 5, 'b': 10, 'c': 20}]
df = pd.DataFrame(data, index=['first', 'second'])
df

        a   b     c
first   1   2   NaN
second  5  10  20.0

In [67]:
data = [{'a': 1, 'b': 2},{'a': 5, 'b': 10, 'c': 20}]
df1 = pd.DataFrame(data, index=['first', 'second'], columns=['a', 'b', 'd'])
df1

        a   b   d
first   1   2 NaN
second  5  10 NaN

In [68]:
dl = {'城市': ['北京','上海','广州','深圳'],
      '环比': [101.5, 101.2, 101.3, 102.0],
      '同比': [120.7, 127.3, 119.4, 140.9],
      '定基': [121.4, 127.8, 120.0, 145.5]}
d = pd.DataFrame(dl, index=['c1','c2','c3','c4'])
d

    城市     环比     同比     定基
c1  北京  101.5  120.7  121.4
c2  上海  101.2  127.3  127.8
c3  广州  101.3  119.4  120.0
c4  深圳  102.0  140.9  145.5

In [69]:
d.index

Index(['c1', 'c2', 'c3', 'c4'], dtype='object')

In [70]:
d.columns

Index(['城市', '环比', '同比', '定基'], dtype='object')

In [71]:
d.values

array([['北京', 101.5, 120.7, 121.4],
       ['上海', 101.2, 127.3, 127.8],
       ['广州', 101.3, 119.4, 120.0],
       ['深圳', 102.0, 140.9, 145.5]], dtype=object)

In [72]:
d['同比']

c1    120.7
c2    127.3
c3    119.4
c4    140.9
Name: 同比, dtype: float64

In [73]:
d.loc['c1']

城市       北京
环比    101.5
同比    120.7
定基    121.4
Name: c1, dtype: object

In [74]:
d.iloc[0]

城市       北京
环比    101.5
同比    120.7
定基    121.4
Name: c1, dtype: object

In [75]:
d[1:3]

    城市     环比     同比     定基
c2  上海  101.2  127.3  127.8
c3  广州  101.3  119.4  120.0

In [76]:
d.loc['c2','城市']

'上海'

In [77]:
d.iloc[1,0]

'上海'

In [78]:
d.loc[:,'城市']

c1    北京
c2    上海
c3    广州
c4    深圳
Name: 城市, dtype: object

In [79]:
d.loc[:,['城市','同比']]

    城市     同比
c1  北京  120.7
c2  上海  127.3
c3  广州  119.4
c4  深圳  140.9

In [80]:
d.iloc[1][0]

'上海'

In [81]:
d.iloc[1]['城市']

'上海'

In [82]:
d.loc['c2'][0]

'上海'

In [83]:
d.loc['c2']['城市']

'上海'

In [84]:
d['城市'][1]

'上海'

In [85]:
d['城市']['c2']

'上海'

In [86]:
d['其他'] = None
d

    城市     环比     同比     定基    其他
c1  北京  101.5  120.7  121.4  None
c2  上海  101.2  127.3  127.8  None
c3  广州  101.3  119.4  120.0  None
c4  深圳  102.0  140.9  145.5  None

In [87]:
del d['其他']
d

    城市     环比     同比     定基
c1  北京  101.5  120.7  121.4
c2  上海  101.2  127.3  127.8
c3  广州  101.3  119.4  120.0
c4  深圳  102.0  140.9  145.5

In [88]:
dl = {'城市': ['北京','上海','广州','深圳'],
      '环比': [101.5, 101.2, 101.3, 102.0],
      '同比': [120.7, 127.3, 119.4, 140.9],
      '定基': [121.4, 127.8, 120.0, 145.5]}
d = pd.DataFrame(dl, index=['c1','c2','c3','c4'])
d

    城市     环比     同比     定基
c1  北京  101.5  120.7  121.4
c2  上海  101.2  127.3  127.8
c3  广州  101.3  119.4  120.0
c4  深圳  102.0  140.9  145.5

In [89]:
d['其他'] = None
d

    城市     环比     同比     定基    其他
c1  北京  101.5  120.7  121.4  None
c2  上海  101.2  127.3  127.8  None
c3  广州  101.3  119.4  120.0  None
c4  深圳  102.0  140.9  145.5  None

In [90]:
x = d.pop('其他')
x

c1    None
c2    None
c3    None
c4    None
Name: 其他, dtype: object

In [91]:
type(x)

pandas.core.series.Series

In [92]:
dl = pd.DataFrame({'城市':['杭州'], '环比':[100.1],
                   '同比':[101.4], '定基':[101.6]}, index=['c5'])
d = d.append(dl)
d

    城市     环比     同比     定基
c1  北京  101.5  120.7  121.4
c2  上海  101.2  127.3  127.8
c3  广州  101.3  119.4  120.0
c4  深圳  102.0  140.9  145.5
c5  杭州  100.1  101.4  101.6

In [93]:
d.drop('定基',axis=1)

    城市     环比     同比
c1  北京  101.5  120.7
c2  上海  101.2  127.3
c3  广州  101.3  119.4
c4  深圳  102.0  140.9
c5  杭州  100.1  101.4

In [94]:
d

    城市     环比     同比     定基
c1  北京  101.5  120.7  121.4
c2  上海  101.2  127.3  127.8
c3  广州  101.3  119.4  120.0
c4  深圳  102.0  140.9  145.5
c5  杭州  100.1  101.4  101.6

In [95]:
dl = pd.DataFrame({'城市':['杭州'], '环比':[100.1],
                   '同比':[101.4], '定基':[101.6]}, index=['c5'])
d = d.append(dl)
d

    城市     环比     同比     定基
c1  北京  101.5  120.7  121.4
c2  上海  101.2  127.3  127.8
c3  广州  101.3  119.4  120.0
c4  深圳  102.0  140.9  145.5
c5  杭州  100.1  101.4  101.6
c5  杭州  100.1  101.4  101.6

In [96]:
d.drop('c5',inplace=True)
d

    城市     环比     同比     定基
c1  北京  101.5  120.7  121.4
c2  上海  101.2  127.3  127.8
c3  广州  101.3  119.4  120.0
c4  深圳  102.0  140.9  145.5

In [97]:
d.T

       c1     c2     c3     c4
城市     北京     上海     广州     深圳
环比  101.5  101.2  101.3    102
同比  120.7  127.3  119.4  140.9
定基  121.4  127.8    120  145.5

In [98]:
ind = pd.Index([2, 3, 5, 7, 11])
ind

Int64Index([2, 3, 5, 7, 11], dtype='int64')

In [99]:
ind[1]

3

In [100]:
ind[::2]

Int64Index([2, 5, 11], dtype='int64')

In [101]:
print(ind.size, ind.shape, ind.ndim, ind.dtype)

5 (5,) 1 int64

In [102]:
indA = pd.Index([1, 3, 5, 7, 9])
indB = pd.Index([2, 3, 5, 7, 11])

In [103]:
indA & indB # 交集

Int64Index([3, 5, 7], dtype='int64')

In [104]:
indA | indB # 并集

Int64Index([1, 2, 3, 5, 7, 9, 11], dtype='int64')

In [105]:
indA ^ indB # 异或

Int64Index([1, 2, 9, 11], dtype='int64')

In [106]:
import pandas as pd
import numpy as np
rng = np.random.RandomState(42)
ser = pd.Series(rng.randint(0, 10, 4))
ser

0    6
1    3
2    7
3    4
dtype: int64

In [107]:
df = pd.DataFrame(rng.randint(0, 10, (3, 4)),
                  columns=['A', 'B', 'C', 'D'])
df

   A  B  C  D
0  6  9  2  6
1  7  4  3  7
2  7  2  5  4

In [108]:
np.exp(ser)

0     403.428793
1      20.085537
2    1096.633158
3      54.598150
dtype: float64

In [109]:
np.sin(df * np.pi / 4)

          A             B         C             D
0 -1.000000  7.071068e-01  1.000000 -1.000000e+00
1 -0.707107  1.224647e-16  0.707107 -7.071068e-01
2 -0.707107  1.000000e+00 -0.707107  1.224647e-16

In [110]:
area = pd.Series({'Alaska': 1723337, 'Texas': 695662,
                  'California': 423967}, name='area')
population = pd.Series({'California': 38332521, 'Texas': 26448193,
                        'New York': 19651127}, name='population')
population / area

Alaska              NaN
California    90.413926
New York            NaN
Texas         38.018740
dtype: float64

In [111]:
A = pd.Series([2, 4, 6], index=[0, 1, 2]) 
B = pd.Series([1, 3, 5], index=[1, 2, 3])
A + B

0    NaN
1    5.0
2    9.0
3    NaN
dtype: float64

In [112]:
A.add(B, fill_value=0)

0    2.0
1    5.0
2    9.0
3    5.0
dtype: float64

In [113]:
A = pd.DataFrame(rng.randint(0, 20, (2, 2)),
                 columns=list('AB'))
A

   A   B
0  1  11
1  5   1

In [114]:
B = pd.DataFrame(rng.randint(0, 10, (3, 3)),
                 columns=list('BAC'))
B

   B  A  C
0  4  0  9
1  5  8  0
2  9  2  6

In [115]:
A + B

      A     B   C
0   1.0  15.0 NaN
1  13.0   6.0 NaN
2   NaN   NaN NaN

In [116]:
fill = A.stack().mean()
A.add(B, fill_value=fill)

      A     B     C
0   1.0  15.0  13.5
1  13.0   6.0   4.5
2   6.5  13.5  10.5

In [117]:
import numpy as np
import pandas as pd
vals1 = np.array([1, None, 3, 4])
vals1

array([1, None, 3, 4], dtype=object)

In [118]:
vals2 = np.array([1, np.nan, 3, 4])
vals2.dtype

dtype('float64')

In [119]:
1 + np.nan

nan

In [120]:
0 *  np.nan

nan

In [121]:
vals2.sum(), vals2.min(), vals2.max()

(nan, nan, nan)

In [122]:
np.nansum(vals2), np.nanmin(vals2), np.nanmax(vals2)

(8.0, 1.0, 4.0)

In [123]:
pd.Series([1, np.nan, 2, None])

0    1.0
1    NaN
2    2.0
3    NaN
dtype: float64

In [124]:
x = pd.Series(range(2), dtype=int)
x

0    0
1    1
dtype: int64

In [125]:
x[0] = None
x

0    NaN
1    1.0
dtype: float64

In [126]:
data = pd.Series([1, np.nan, 'hello', None])
data.isnull()

0    False
1     True
2    False
3     True
dtype: bool

In [127]:
data[data.notnull()]

0        1
2    hello
dtype: object

In [128]:
data.dropna()

0        1
2    hello
dtype: object

In [129]:
df = pd.DataFrame([[1, np.nan, 2],
                   [2, 3, 5],
                   [np.nan, 4, 6]])
df

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [130]:
df.dropna()

     0    1  2
1  2.0  3.0  5

In [131]:
df.dropna(axis='columns')

   2
0  2
1  5
2  6

In [132]:
df[3] = np.nan
df

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  NaN  4.0  6 NaN

In [133]:
df.dropna(axis='columns', how='all')

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [162]:
df

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  NaN  4.0  6 NaN

In [161]:
df.dropna(axis='rows', thresh=3)

     0    1  2   3
1  2.0  3.0  5 NaN

In [135]:
data = pd.Series([1, np.nan, 2, None, 3], index=list('abcde'))
data

a    1.0
b    NaN
c    2.0
d    NaN
e    3.0
dtype: float64

In [136]:
data.fillna(0)

a    1.0
b    0.0
c    2.0
d    0.0
e    3.0
dtype: float64

In [137]:
# 从前往后填充
data.fillna(method='ffill')

a    1.0
b    1.0
c    2.0
d    2.0
e    3.0
dtype: float64

In [138]:
# 从后往前填充 
data.fillna(method='bfill')

a    1.0
b    2.0
c    2.0
d    3.0
e    3.0
dtype: float64

In [139]:
ser1 = pd.Series(['A', 'B', 'C'], index=[1, 2, 3])
ser2 = pd.Series(['D', 'E', 'F'], index=[4, 5, 6])
pd.concat([ser1, ser2])

1    A
2    B
3    C
4    D
5    E
6    F
dtype: object

In [140]:
def make_df(cols, ind): 
    """一个简单的DataFrame"""
    data = {c: [str(c) + str(i) for i in ind]
            for c in cols}
    return pd.DataFrame(data, ind)
# DataFrame示例 
make_df('ABC', range(3))

    A   B   C
0  A0  B0  C0
1  A1  B1  C1
2  A2  B2  C2

In [141]:
df1 = make_df('AB', [1, 2])
df2 = make_df('AB', [3, 4])
print(df1); print(df2); print(pd.concat([df1, df2]))

    A   B
1  A1  B1
2  A2  B2
    A   B
3  A3  B3
4  A4  B4
    A   B
1  A1  B1
2  A2  B2
3  A3  B3
4  A4  B4

In [142]:
x = make_df('AB', [0, 1])
y = make_df('AB', [2, 3])
y.index = x.index # 复制索引
print(x); print(y); print(pd.concat([x, y]))

    A   B
0  A0  B0
1  A1  B1
    A   B
0  A2  B2
1  A3  B3
    A   B
0  A0  B0
1  A1  B1
0  A2  B2
1  A3  B3

In [143]:
try:
    pd.concat([x, y], verify_integrity=True) 
except ValueError as e:
    print("ValueError:", e)

ValueError: Indexes have overlapping values: Int64Index([0, 1], dtype='int64')

In [144]:
print(x)
print(y)
print(pd.concat([x, y], ignore_index=True))

    A   B
0  A0  B0
1  A1  B1
    A   B
0  A2  B2
1  A3  B3
    A   B
0  A0  B0
1  A1  B1
2  A2  B2
3  A3  B3

In [145]:
print(x)
print(y)
print(pd.concat([x, y], keys=['x', 'y']))

    A   B
0  A0  B0
1  A1  B1
    A   B
0  A2  B2
1  A3  B3
      A   B
x 0  A0  B0
  1  A1  B1
y 0  A2  B2
  1  A3  B3

In [146]:
df5 = make_df('ABC', [1, 2])
df6 = make_df('BCD', [3, 4])
print(df5)
print(df6)
print(pd.concat([df5, df6]))

    A   B   C
1  A1  B1  C1
2  A2  B2  C2
    B   C   D
3  B3  C3  D3
4  B4  C4  D4
     A   B   C    D
1   A1  B1  C1  NaN
2   A2  B2  C2  NaN
3  NaN  B3  C3   D3
4  NaN  B4  C4   D4

/Users/byj/opt/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:5: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """

In [147]:
print(df5)
print(df6)
print(pd.concat([df5, df6], join='inner'))

    A   B   C
1  A1  B1  C1
2  A2  B2  C2
    B   C   D
3  B3  C3  D3
4  B4  C4  D4
    B   C
1  B1  C1
2  B2  C2
3  B3  C3
4  B4  C4

In [148]:
print(df5)
print(df6)
print(pd.concat([df5, df6], join_axes=[df5.columns]))

    A   B   C
1  A1  B1  C1
2  A2  B2  C2
    B   C   D
3  B3  C3  D3
4  B4  C4  D4
     A   B   C
1   A1  B1  C1
2   A2  B2  C2
3  NaN  B3  C3
4  NaN  B4  C4

/Users/byj/opt/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:3: FutureWarning: The join_axes-keyword is deprecated. Use .reindex or .reindex_like on the result to achieve the same functionality.
  This is separate from the ipykernel package so we can avoid doing imports until

In [149]:
print(df1)
print(df2)
print(df1.append(df2))

    A   B
1  A1  B1
2  A2  B2
    A   B
3  A3  B3
4  A4  B4
    A   B
1  A1  B1
2  A2  B2
3  A3  B3
4  A4  B4

In [150]:
df1 = pd.DataFrame({'employee': ['Bob', 'Jake', 'Lisa', 'Sue'],
                    'group': ['Accounting', 'Engineering', 'Engineering', 'HR']})
df2 = pd.DataFrame({'employee': ['Lisa', 'Bob', 'Jake', 'Sue'],
                    'hire_date': [2004, 2008, 2012, 2014]})
print(df1); print(df2)

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR
  employee  hire_date
0     Lisa       2004
1      Bob       2008
2     Jake       2012
3      Sue       2014

In [151]:
df3 = pd.merge(df1, df2)

  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014

In [152]:
df4 = pd.DataFrame({'group': ['Accounting', 'Engineering', 'HR'],
                    'supervisor': ['Carly', 'Guido', 'Steve']})
print(df3); print(df4); print(pd.merge(df3, df4))

  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014
         group supervisor
0   Accounting      Carly
1  Engineering      Guido
2           HR      Steve
  employee        group  hire_date supervisor
0      Bob   Accounting       2008      Carly
1     Jake  Engineering       2012      Guido
2     Lisa  Engineering       2004      Guido
3      Sue           HR       2014      Steve

In [153]:
df5 = pd.DataFrame({'group': ['Accounting', 'Accounting',
                              'Engineering', 'Engineering', 'HR', 'HR'],
                    'skills': ['math', 'spreadsheets', 'coding', 'linux',
                               'spreadsheets', 'organization']})
print(df1); print(df5); print(pd.merge(df1, df5))

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR
         group        skills
0   Accounting          math
1   Accounting  spreadsheets
2  Engineering        coding
3  Engineering         linux
4           HR  spreadsheets
5           HR  organization
  employee        group        skills
0      Bob   Accounting          math
1      Bob   Accounting  spreadsheets
2     Jake  Engineering        coding
3     Jake  Engineering         linux
4     Lisa  Engineering        coding
5     Lisa  Engineering         linux
6      Sue           HR  spreadsheets
7      Sue           HR  organization

In [154]:
print(df1); print(df2); print(pd.merge(df1, df2, on='employee'))

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR
  employee  hire_date
0     Lisa       2004
1      Bob       2008
2     Jake       2012
3      Sue       2014
  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014

In [155]:
df3 = pd.DataFrame({'name': ['Bob', 'Jake', 'Lisa', 'Sue'],
                    'salary': [70000, 80000, 120000, 90000]})
print(df1); print(df3);
print(pd.merge(df1, df3, left_on="employee", right_on="name"))

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR
   name  salary
0   Bob   70000
1  Jake   80000
2  Lisa  120000
3   Sue   90000
  employee        group  name  salary
0      Bob   Accounting   Bob   70000
1     Jake  Engineering  Jake   80000
2     Lisa  Engineering  Lisa  120000
3      Sue           HR   Sue   90000

In [156]:
df1a = df1.set_index('employee')
df2a = df2.set_index('employee')
print(df1a); print(df2a)

                group
employee
Bob        Accounting
Jake      Engineering
Lisa      Engineering
Sue                HR
          hire_date
employee
Lisa           2004
Bob            2008
Jake           2012
Sue            2014

In [157]:
print(df1a); print(df2a);
print(pd.merge(df1a, df2a, left_index=True, right_index=True))

                group
employee
Bob        Accounting
Jake      Engineering
Lisa      Engineering
Sue                HR
          hire_date
employee
Lisa           2004
Bob            2008
Jake           2012
Sue            2014
                group  hire_date
employee
Bob        Accounting       2008
Jake      Engineering       2012
Lisa      Engineering       2004
Sue                HR       2014

In [158]:
print(df1a); print(df2a); print(df1a.join(df2a))

                group
employee
Bob        Accounting
Jake      Engineering
Lisa      Engineering
Sue                HR
          hire_date
employee
Lisa           2004
Bob            2008
Jake           2012
Sue            2014
                group  hire_date
employee
Bob        Accounting       2008
Jake      Engineering       2012
Lisa      Engineering       2004
Sue                HR       2014

In [159]:
df8 = pd.DataFrame({'name': ['Bob', 'Jake', 'Lisa', 'Sue'],
                    'rank': [1, 2, 3, 4]})
df9 = pd.DataFrame({'name': ['Bob', 'Jake', 'Lisa', 'Sue'],
                    'rank': [3, 1, 4, 2]})
print(df8); print(df9); print(pd.merge(df8, df9, on="name"))

   name  rank
0   Bob     1
1  Jake     2
2  Lisa     3
3   Sue     4
   name  rank
0   Bob     3
1  Jake     1
2  Lisa     4
3   Sue     2
   name  rank_x  rank_y
0   Bob       1       3
1  Jake       2       1
2  Lisa       3       4
3   Sue       4       2

In [160]:
print(df8); print(df9);
print(pd.merge(df8, df9, on="name", suffixes=["_L", "_R"]))

   name  rank
0   Bob     1
1  Jake     2
2  Lisa     3
3   Sue     4
   name  rank
0   Bob     3
1  Jake     1
2  Lisa     4
3   Sue     2
   name  rank_L  rank_R
0   Bob       1       3
1  Jake       2       1
2  Lisa       3       4
3   Sue       4       2